Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: བདག་དང་གཞན་གྱི་རྗེས་སུ་སྲུང་བས་ངོ་ཚ་ཤེས་ཤིང་ཁྲེལ་ཡོད་པ་ཡིན།
en: he has a conscience because he guards himself and others;

source: སྡོམ་པ་དང་ཚུལ་མ་བོར་བས་དགའ་བ་དང་ལྡན་པ་ཡིན།
en: he has steadfastness because he does not abandon the conduct of the vows;

source: གནས་དང་གནས་མ་ཡིན་པ་ལ་མཁས་ཤིང་ཤིན་ཏུ་བརྟགས་པས་བློ་དང་ལྡན་པ་ཡིན།
en: he has judgment because he has wisely considered well what is possible and what is impossible;

source: གཞན་གྱི་དྲིང་མི་འཇོག་པས་ཡེ་ཤེས་དང་ལྡན་པ་ཡིན།
en: he has discernment because he is not led by others;

source: དོན་དང་དོན་མ་ཡིན་པའི་ཚིག་ཡང་དག་པར་དབྱེ་བ་ལ་མཁས་པས་ཤེས་རབ་དང་ལྡན་པ་ཡིན།
en: he has knowledge because he is skilled in differentiating between what is and is not the meaning of words;

source: བསྒོམ་པ་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པས་མངོན་པར་ཤེས་པ་བསྒྲུབ་པ་ཐོབ་པ་ཡིན།
en: he has attained the accomplishment of clairvoyance because he is skilled in the accomplishment of meditation;

source: འཇིག་རྟེན་གྱི་རྗེས་སུ་འབྲང་བས་ཐབས་ལ་མཁས་པ་ཡིན།
en: he is wise in methods because he acts in accord with the world;

source: བསོད་ནམས་ཀྱི་ཚོགས་ཉེ་བར་སྩོགས་པས་ངོམས་མི་ཤེས་པ་ཡིན།
en: he is never satisfied, because he is gathering the accumulation of merit;

source: ཡེ་ཤེས་ཀྱི་ཚོགས་ཡོངས་སུ་ཚོལ་བས་བརྩོན་འགྲུས་རྒྱུན་མི་འཆད་པ་ཡིན།
en: his diligence is unceasing because he seeks the accumulation of wisdom;

source: བྱམས་པ་དང་སྙིང་རྗེ་ཆེན་པོའི་ཚོགས་ཡང་དག་པར་སོགས་པས་སྐྱོ་བ་མེད་པའི་བསམ་པ་དང་ལྡན་པ་ཡིན།
en: he is never wearied in mind because he has accumulated the accumulation of great love and compassion;

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཡོངས་སུ་ཚོལ་བས་སྙོམ་ལས་མེད་པར་ཡོངས་སུ་ཚོལ་བ་ལ་བརྩོན་པ་ཡིན།
en: he is resolutely engaged in his quest because he seeks a tathāgata’s strengths, confidences, and unique buddha qualities;

source: སངས་རྒྱས་ཀྱི་ཞིང་བསྒྲུབ་པ་དང་། རྒྱན་མངོན་པར་ཤོམ་པས་མངོན་པར་བསྒྲུབ་པའི་ཡིད་དང་ལྡན་པ་ཡིན།
en: he is intent on accomplishment because he accomplishes the manifestation of buddha-realm adornments;

source: མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡང་དག་པར་བསྒྲུབ་པས་དགེ་བ་རྣམ་པ་སྣ་ཚོགས་ལ་བརྩོན་པ་ཡིན།
en: he engages in a variety of good actions because he accomplishes the Buddha’s primary and secondary signs;

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་དང་གསུང་དང་ཐུགས་ཀྱི་རྒྱན་ཡོངས་སུ་ཚོལ་བས། རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་བརྩོན་པ་ཡིན།
en: he applies himself constantly because he seeks the adornments of a tathāgata’s body, speech, and mind;

source: བྱང་ཆུབ་སེམས་དཔའ་དང་ཆོས་སྨྲ་བ་ཐམས་ཅད་ལ་རིམ་གྲོ་བྱེད་པས་བསྙེན་བཀུར་དང་། སྲི་ཞུ་ཆེན་པོའི་དང་ཚུལ་ཅན་ཡིན།
en: he has a conduct of great respect and service because of his attendance on all bodhisattvas and dharmabhāṇakas;

source: བྱང་ཆུབ་ཀྱི་སེམས་དང་ཐབས་མཁས་པ་ཆེན་པོའི་ངང་ཚུལ་དང་ལྡན་པར་འཇིག་རྟེན་དུ་རྒྱུ་བས་ཁོང་ཁྲོ་བ་མེད་པའི་སེམས་དང་ལྡན་པ་ཡིན།
en: his mind is unimpeded because he wanders through the world furnished with the union of bodhicitta and great skillful methods;

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་མངོན་པར་བརྩོན་པས་ཉིན་མཚན་དུ་གཞན་དུ་སེམས་པའི་ཡིད་ཡོངས་སུ་སྤངས་པ་ཡིན་ཏེ།
en: and he rejects all other thoughts day and night because he is dedicated to ripening all beings.

source: དེ་དེ་ལྟར་མངོན་པར་བརྩོན་པས་སྦྱིན་པས་ཀྱང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །ངག་སྙན་པ་དང་། དོན་བསྒྲུབ་པ་དང་། དོན་མཐུན་པ་དང་གཟུགས་ཀྱི་ལུས་ཀུན་ཏུ་བསྟན་པ་དང་། ཆོས་བཤད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བརྗོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཆེ་བ་ཉིད་སྨོས་པ་དང་། འཁོར་བའི་ཉེས་པ་བསྟན་པ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་ཡོན་ཏན་ཡོངས་སུ་གྲག་པར་བྱ་བ་དང་། རྫུ་འཕྲུལ་དང་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོ་མངོན་པར་བསྒྲུབ་པ་དང་། བྱ་བ་དང་ཐབས་རྣམ་པ་སྣ་ཚོགས་ཀྱི་སྦྱོར་བས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ།
en: “He who is thus engaged also ripens beings through generosity, kind words, actions that benefit others, practicing what he preaches, manifesting a physical body, teaching the Dharma, promulgating the conduct of a bodhisattva, describing the greatness of the tathāgatas, teaching the faults of saṃsāra, proclaiming the qualities of a buddha’s wisdom, and engagement in the activity of accomplishing miracles and transformations.

source: །དེ་ལྟར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་མངོན་པར་བརྩོན་པ་དང་ལྡན་ཞིང་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་སོང་བའི་བསམ་པ་ཅན་དགེ་བའི་རྩ་བ་ཕྱིར་མི་ལྡོག་པའི་སྦྱོར་བ་དང་ལྡན་པ།
en: He who is thus engaged in ripening beings has a mind dedicated to the wisdom of buddhahood, is irreversibly engaged in the roots of goodness, and is dedicated to seeking the unique Dharma. “With compassion for beings, in order to gradually lead them to the Buddha’s Dharma, he is accomplished in writing, treatises, hand calculation, the calculation of numbers, the abacus, and so on; the science of minerals and the science of medicine; driving out consumption, epilepsy, and possession; repelling the use of poison and vetālas;

source: ཁྱད་པར་ཅན་གྱི་ཆོས་ཡོངས་སུ་བཙལ་བ་ལ་མངོན་པར་བརྩོན་པ་དེ་གང་འདི་འཇིག་རྟེན་ན་ཡོད་པའི་ཡི་གེ་དང་གཙུག་ལག་དང་། ལག་བརྡ་དང་། གྲངས་དང་། རྩིས་དང་། ཤོད་ཐབས་ལས་སྩོགས་པ་དང་། ཁམས་ཀྱི་ཆོ་ག་དང་། གསོ་བའི་ཆོ་ག་དང་། སྐེམ་པ་དང་། བརྗེད་བྱེད་དང་། འབྱུང་པོའི་གདོན་བསལ་བ་དང་། དུག་དང་རོ་ལངས་ཀྱི་སྦྱོར་བ་བསལ་བ་དང་། རང་བཟོ་དང་གར་གྱི་ཆོ་ག་དང་། གཏམ་དང་། རོལ་མོ་དང་། སྒྲུང་གཏམ་དགའ་བ་བསྐྱེད་པ་དང་། གྲོང་དང་གྲོང་ཁྱེར་དང་། བཟའ་ཤིང་གི་ར་བ་དང་། ཆུ་ཀླུང་དང་། མཚེའུ་དང་། ལྟེང་ཀ་དང་། རྫིང་བུ་དང་། མེ་ཏོག་དང་། ཤིང་ཏོག་དང་། རྩི་དང་། ནགས་ཚལ་མངོན་པར་བསྒྲུབ་པ་དང་། གསེར་དང་། དངུལ་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻཌཱུརྱ་དང་། དུང་དང་། རིན་པོ་ཆེ་ཤི་ལ་དང་། བྱི་རུ་དང་། རིན་པོ་ཆེ་རྣམས་ཀྱི་འབྱུང་གནས་བསྟན་པ་དང་། ཉི་མ་དང་ཟླ་བ་དང་། གཟའ་དང་རྒྱུ་སྐར་དང་། ས་གཡོ་བ་དང་། རི་དགས་ཀྱི་ལྟས་དང་། རྨི་ལམ་དང་། ལྟས་བསྟན་པ་ལ་འཇུག་པ་དང་། ཡན་ལག་དང་། ཉིང་ལག་གི་མཚན་དང་། སྤྱོད་པའི་མཚན་དང་། སྡོམ་པ་དང་། ཚུལ་དང་། བསམ་གཏན་དང་། མངོན་པར་ཤེས་པ་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་གནས་རྣམས་དང་། གཞན་ཡང་གང་སེམས་ཅན་ལ་འཚེ་བར་མི་འགྱུར་བའི་སྦྱོར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བར་འགྱུར་བ་ཡོང་དགུ་དེ་དག་ཐམས་ཅད་འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བས་རིམ་གྱིས་སངས་རྒྱས་ཀྱི་ཆོས་ལ་རབ་ཏུ་དགོད་པའི་ཕྱིར་མངོན་པར་སྒྲུབ་བོ།
en: entertainment through poetry, dance, storytelling, music, and histories; the creation of villages, towns, parks, rivers, lakes, ponds, lotus pools, flowers, fruits, herbs, and groves; revealing the sources of gold, silver, jewels, pearls, beryls, conch, bitumen, coral, and jewels; determining omens through the moon, the sun, the planets, the stars, the constellations, earthquakes, wild animals, birds, and dreams; the portents of the larger and smaller parts of the body, and the omens of ways of walking; the vows, the conduct, the dhyānas, the clairvoyances, the immeasurables, and the formless states; and also all other kinds of activities that are not injurious to beings and bring benefit and happiness to all beings.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཤིན་ཏུ་རྒྱལ་བར་དཀའ་བ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལྟ་བ་རྒྱ་ཆེན་པོ་དང་། སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་སངས་རྒྱས་མང་པོ་སྣང་བར་འགྱུར་ཏེ།
en: “When the bodhisattva is on Difficult to Conquer, the fifth bodhisattva bhūmi, many buddhas will appear to him because of his vast view and the power of his prayers.

source: ལྟ་བ་རྒྱ་ཆེན་པོ་དང་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་སངས་རྒྱས་བརྒྱ་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་སྣང་བར་འགྱུར་རོ། །དེས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་མཐོང་ནས་བསམ་པ་རྒྱ་ཆེན་པོས་རིམ་གྲོ་བྱེད་དོ། །བཀུར་སྟི་བྱེད་དོ། །བསྟི་སྟང་བྱེད་དོ། །མཆོད་པ་བྱེད་དོ།
en: Many hundreds of buddhas, many thousands of buddhas, many hundreds of thousands of buddhas, many millions of buddhas, many tens of millions of buddhas, many billions of buddhas, many tens of billions of buddhas, many trillions of buddhas, and many quintillions of buddhas will appear to him because of his vast view and the power of his prayers.

source: །ན་བཟའ་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་གྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་དག་ཀྱང་འབུལ་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་འབུལ་ལོ།
en: He will see those tathāgatas, those arhats, those samyak­sambuddhas, and with a vast motivation he will serve them, worship them, honor them, make offerings to them, supply them with robes, alms, bowls, beds, medicine for when they are ill, and implements. He will also offer all the articles that bring happiness to a bodhisattva.

source: དགེ་འདུན་གྱི་ཚོགས་རྣམས་ལ་ཡང་ཡང་དག་པར་མཆོད་པ་བྱེད་དོ།
en: He will also offer to the assemblies of the Saṅgha.

source: །དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ།
en: He will dedicate all those roots of goodness to the highest complete enlightenment.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ལ་རིམ་གྲོ་བྱེད་ཅིང་དེ་དག་ལས་རིམ་གྲོ་དང་། ཞེ་ས་དང་བསྟི་སྟང་དུ་ཆོས་བསྟན་པ་ཉན་ཏོ། །ལེན་ཏོ་འཛིན་ཏོ།
en: He serves those tathāgata arhat samyak­sambuddhas and he listens to the Dharma, acquires it, and retains it with respect, reverence, and honor.

source: །ཐོས་ནས་ཀྱང་ཅི་ཚུལ་དུ་ནན་ཏན་གྱིས་ཡང་དག་པར་བསྒྲུབས་ཏེ།
en: When he has heard it, he accomplishes it through practicing it fully and perfectly.

source: དེ་དག་ལས་ཕལ་ཆེར་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་ངོ་།
en: He enters mendicancy within the teaching of many of those tathāgatas.

source: །རབ་ཏུ་བྱུང་ནས་ཀྱང་ཐོས་པ་འཛིན་པའི་གཟུངས་རབ་ཏུ་ཐོབ་པའི་ཆོས་སྨྲ་བར་འགྱུར་བ་ཡིན།
en: Having become a mendicant he becomes a dharmabhāṇaka who has attained the power to remember all that he has heard.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ས་ཤིན་ཏུ་རྒྱལ་བར་དཀའ་བ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེའི་དགེ་བའི་རྩ་བ་དེ་དག་བསྐལ་པ་དུ་མར་ཤིན་ཏུ་བྱང་བ་དང་། ཡོངས་སུ་དག་པ་དང་། འོད་རབ་ཏུ་གསལ་བར་གནས་སོ།
en: “The roots of goodness of the bodhisattva who resides on the Difficult to Conquer bodhisattva bhūmi become purer, clearer, and brighter over many eons.

source: །བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མར་དགེ་བའི་རྩ་བ་དེ་དག་ཤིན་ཏུ་བྱང་བ་དང་ཡོངས་སུ་དག་པ་དང་། རབ་ཏུ་འོད་གསལ་བར་གནས་སོ།
en: They become purer, clearer, and brighter over many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, many trillions of eons, many tens of trillions of eons, many quadrillions of eons, many tens of quadrillions of eons, many quintillions of eons, and many tens of quintillions of eons. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །གསེར་གྱི་ས་ལེ་སྦྲམ་དེ་ཉིད་རིན་པོ་ཆེ་མུ་ས་ར་གལ་པས་བཏབ་ན་དེ་བས་ཀྱང་ཡོངས་སུ་འཚེར་རོ། །ཡོངས་སུ་དག་པར་འགྱུར་རོ། །འོད་ཤིན་ཏུ་གསལ་ཞིང་དང་བར་འགྱུར་རོ།
en: When gold is adorned with white coral it becomes clearer, purer, and brighter. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་ཤིན་ཏུ་རྒྱལ་བར་དཀའ་བ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བ་ཐབས་དང་། ཤེས་རབ་ཀྱིས་རྣམ་པར་སྤྱད་པ་ཡང་དེ་བས་ཀྱང་ཤིན་ཏུ་བྱང་བ་དང་། ཡོངས་སུ་དག་པ་དང་རབ་ཏུ་འོད་གསལ་ཞིང་དང་བ་ཡིན། ཡེ་ཤེས་ཀྱི་སྦྱོར་བའི་ཡོན་ཏན་མངོན་པར་བསྒྲུབ་པ་དང་ལྡན་པ་ཡིན། མི་འཕྲོགས་ཤིང་ཤིན་ཏུ་བརྟགས་པ་ཡིན།
en: In that same way, the roots of goodness of the bodhisattva who is on Difficult to Conquer, the fifth bodhisattva bhūmi, become purer, clearer, and brighter through examination by method and wisdom, and through attaining the qualities of the application of wisdom, they have the perfect examination that cannot be sullied.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ལྟ་སྟེ།
en: “O jinaputras! It is like this:

source: དཔེར་ན། ཉི་མ་དང་ཟླ་བ་དང་། སྐར་མ་དང་། རྒྱུ་སྐར་གྱི་གཞལ་མེད་ཁང་གི་འོད་སྣང་བ་ནི་རླུང་གི་དཀྱིལ་འཁོར་གྱིས་མི་འཕྲོགས་ཤིང་རླུང་དང་ཐུན་མོང་དུ་མི་སྤྱོད་པ་ཡིན།
en: to give an analogy, the bright radiance of the divine palaces of the sun, the moon, the stars, and the constellations cannot be sullied by the circles of air, because it is distinct from the air.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་པས་ས་ཤིན་ཏུ་རྒྱལ་བར་དཀའ་བ་འདི་ལ་གནས་པའི་དགེ་བའི་རྩ་བ་ཐབས་དང་ཤེས་རབ་དང་ཡེ་ཤེས་དང་སེམས་ཀྱིས་ཤིན་ཏུ་བརྟགས་པ་དང་ལྡན་པ་ཡང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་མི་འཕྲོགས་པ་ཡིན། འཇིག་རྟེན་པ་དང་ཐུན་མོང་དུ་མི་སྤྱོད་པ་ཡིན།
en: “O jinaputras! In that same way the bodhisattva who is on Difficult to Conquer, the fifth bodhisattva bhūmi, has roots of goodness that are accompanied by an examining mind that has method, wisdom, and knowledge, that cannot be sullied by śrāvakas and pratyekabuddhas, and that is distinct from that which is mundane.

source: དེའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུ་ལས་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤས་ཆེ་བ་ཡིན་ཏེ། ལྷག་མ་རྣམས་ཀྱང་ཅི་ཚུལ་ཅི་ནུས་སུ་མི་བསྒྲུབ་པ་མ་ཡིན་ནོ།
en: “From among the ten perfections, the perfection of meditation predominates, and the other perfections are not accomplished fully and completely.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཤིན་ཏུ་རྒྱལ་བར་དགའ་བ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་ས་ལྔ་པ་མདོར་བསྟན་པའོ།
en: “O jinaputras! That in brief is Difficult to Conquer, the bodhisattva’s fifth bodhisattva bhūmi.

source: །དེ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕལ་ཆེར་ལྷའི་རྒྱལ་པོ་རབ་དགའ་ལྡན་དུ་འགྱུར་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མུ་སྟེགས་ཀྱི་གནས་ཐམས་ཅད་རྣམ་པར་ཟློག་པ་ལ་མཁས་ཤིང་མཐུ་ཡོད་པ་ཡིན།
en: The bodhisattva who is on that bhūmi usually becomes the deva king Saṃtuṣita, who is wise and powerful in turning beings away from tīrthikas.

source: དེ་སྦྱིན་པ་འམ་ངག་སྙན་པ་འམ། དོན་བསྒྲུབ་པ་འམ། དོན་མཐུན་པས་དགེ་བའི་རྩ་བ་གང་ཅི་རྩོམ་ཡང་རུང་སྟེ། དེ་ཐམས་ཅད་ཇི་ལྟར་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་འགྱུར། གཙོ་བོར་འགྱུར། ཐུ་བོར་འགྱུར། ཕུལ་དུ་འགྱུར། དམ་པར་འགྱུར། བླ་ན་མེད་པར་འགྱུར།
en: “In whatever roots of goodness he accomplishes through generosity, kind words, actions that benefit others, and practicing what he preaches, he becomes supreme, the best, the foremost, the highest, the most excellent, the unsurpassable, the guide, the leader, the commander, and so on, up until becoming the omniscient one who is relied on.

source: འདྲེན་པར་འགྱུར། ཡོངས་སུ་འདྲེན་པར་འགྱུར་བ་ནས། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་བརྟེན་པའི་བར་དུ་འགྱུར་སྙམ་སྟེ། སངས་རྒྱས་ཡིད་ལ་བྱ་བ་དང་། ཆོས་ཡིད་ལ་བྱ་བ་དང་། དགེ་འདུན་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཡིད་ལ་བྱ་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིད་ལ་བྱ་བ་དང་། སྟོབས་ཡིད་ལ་བྱ་བ་དང་། མི་འཇིགས་པ་ཡིད་ལ་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཡིད་ལ་བྱ་བ་ནས། རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་བར་དུ་ཡིད་ལ་བྱ་བ་དང་མི་འབྲལ་བ་ཡིན་ཏེ།
en: His mind is always focused on the Buddha, focused on the Dharma, focused on the Saṅgha, focused on the bodhisattvas, focused on bodhisattva conduct, focused on the bodhisattva bhūmis, focused on the perfections, focused on the strengths, focused on the confidences, focused on the unique qualities of buddhahood, and so on, up until being focused on the omniscient wisdom endowed with the supreme aspects.

source: དེ་འདོད་ན་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་ཏིང་ངེ་འཛིན་ཁྲག་ཁྲིག་ཕྲག་སྟོང་རབ་ཏུ་འཐོབ་ཅིང་དེ་དག་ལ་སྙོམས་པར་འཇུག་པ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་ཕྲག་སྟོང་མཐོང་ཞིང་དེ་དག་གི་བྱིན་གྱི་རླབས་ཀྱང་ཡང་དག་པར་ཤེས་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཁྲག་ཁྲིག་ཕྲག་སྟོང་སྐྱོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཁྲག་ཁྲིག་ཕྲག་སྟོང་དུ་འགྲོ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཁྲག་ཁྲིག་ཕྲག་སྟོང་དུ་སྣང་བར་བྱ་བ་དང་། སེམས་ཅན་ཁྲག་ཁྲིག་ཕྲག་སྟོང་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་ཕྲག་སྟོང་དུ་གནས་པར་བྱ་བ་དང་། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའི་བསྐལ་པ་ཁྲག་ཁྲིག་ཕྲག་སྟོང་ལ་རབ་ཏུ་འཇུག་པ་དང་། ཆོས་ཀྱི་སྒོ་ཁྲག་ཁྲིག་ཕྲག་སྟོང་རྣམ་པར་འབྱེད་པ་དང་། ལུས་ཁྲག་ཁྲིག་ཕྲག་སྟོང་ཡོངས་སུ་བསྟན་པ་དང་། ལུས་རེ་རེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཁྲག་ཁྲིག་ཕྲག་སྟོང་ཡང་དག་པར་བསྟན་པར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་ཀྱི་རྣམ་པ་དེ་ལྟ་བུ་རྩོམ་མོ། །དེ་ཡན་ཅད་བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་གྱི་མཐུ་ཅན་རྣམས་སྨོན་ལམ་གྱི་ཁྱད་པར་གྱིས་རྣམ་པར་འཕྲུལ་ཏེ། དེ་དག་གི་ལུས་སམ།
en: “If he wishes to, he can apply himself in such a way that in just one instant he attains and rests in ten billion samādhis, sees ten billion buddhas and knows their blessings, causes ten billion worlds to shake, goes to ten billion buddha realms, illuminates ten billion worlds, ripens ten billion beings, remains for ten billion eons, enters ten billion previous eons and ten billion future eons, opens ten billion Dharma doors, manifests ten billion bodies, and manifests each body having a retinue of ten billion bodhisattvas.

source: འོད་དམ་རྫུ་འཕྲུལ་ལམ་མིག་གམ། སྤྱོད་ཡུལ་ལམ་དབྱངས་སམ། སྤྱོད་པ་འམ་རྒྱན་ཏམ་བྱིན་གྱིས་རླབས་སམ། མོས་པ་འམ། མངོན་པར་འདུ་བྱེད་པ་དག་ཀྱང་བསྐལ་པ་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ཀྱང་བགྲང་བར་དཀའ་འོ།
en: “From this time onward the bodhisattvas who have the power of prayer through particular prayers manifest bodies, light, miracles, sights, activities, voices, conduct, displays, blessings, transformations, and manifestations for many eons, for many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, and so on, until many quintillions of eons, which are difficult to enumerate.”

source: །རྒྱལ་བའི་སྤྱོད་པ་བཞི་པོ་དེ་ལྟར་རྣམ་སྦྱངས་ཏེ།
en: “Those who are thus purified in the four conducts of the jinas

source: །དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་རྗེས་སུ་སེམས་བྱེད་ཅིང་།
en: Contemplate with their discernment the sameness of the three times.

source: །ཚུལ་ཁྲིམས་སེམས་དང་ནན་ཏན་ལམ་རྣམས་རྣམ་དག་པས།
en: Through the purity of contemplation of correct conduct and ascertainment of the path,

source: །ནེམ་ནུར་མེད་པའི་མཁས་པ་ལྔ་པོ་ཡོངས་སུ་གནོན།
en: And with an understanding that is free of doubt, they ascend to the fifth.

source: །དྲན་པའི་གཞུ་དང་དབང་པོའི་མདའ་རྣོ་ཕྱིར་མི་ལྡོག །ཡང་དག་སྤོང་བ་རྟ་ཡིན་བཞོན་པ་རྫུ་འཕྲུལ་རྐང་།
en: “With the bow of mindfulness and the irreversible sharp arrow of power, The horse of true renunciation, the chariot of the basis of miraculous powers,

source: སྟོབས་ལྔ་གོ་ཅ་དགྲ་རྣམས་ཀྱིས་ནི་ཚུགས་མི་ནུས།
en: The armor of the five strengths, which is invincible to enemies,

source: །དཔའ་བས་མི་ལྡོག་མཁས་པ་ལྔ་པོ་ཡོངས་སུ་གནོན།
en: And the wisdom of the hero who never retreats, they ascend to the fifth.

source: །ངོ་ཚ་ཁྲེལ་ཡོད་གོས་ཡིན་མཁས་པའི་ཚུལ་གཙང་སྤོས།
en: “With the clothes of conscience and sense of shame, the perfume of the pure conduct of the wise,

source: །བྱང་ཆུབ་ཡན་ལག་ཕྲེང་བ་བྱུག་པ་བསམ་གཏན་མཆོག །ཤེས་རབ་རྣམ་པར་དཔྱོད་དང་ཐབས་མཆོག་རྒྱན་ཡིན་ཏེ།
en: The flower garland of the factors for enlightenment, the unguent of the best meditation, The jewelry of wisdom’s examination and the most beautiful methods,

source: །བཟའ་ཤིང་ར་བ་ཏིང་འཛིན་དགའ་ལྡན་ཡང་དག་གནོན།
en: And the garden of samādhi, they ascend to the fifth.

source: །རྫུ་འཕྲུལ་བཞི་པོ་རྐང་པ་དྲན་པ་རྣམ་དག་མགྲིན།
en: “With the legs of the four bases of miraculous powers and the throat of pure mindfulness,

source: །བྱམས་བརྩེ་རྣམ་དག་མིག་ཡིན་ཤེས་རབ་མཆེ་བ་མཆོག །བདག་མེད་ང་རོས་ཉོན་མོངས་དགྲ་རྣམས་རབ་ཏུ་འཇོམས།
en: With eyes of the highest love and compassion and teeth of perfect wisdom, With the war cry of selflessness, attacking the enemies who are the kleśas,

source: །མཁས་པ་མི་ཡི་སེང་གེ་ས་ལྔ་ཡོངས་སུ་གནོན།
en: The wise lions of men ascend to the fifth.

source: །དེ་དག་ས་མཆོག་ལྔ་པོའི་ཕྱོགས་སུ་ཕྱིན་གྱུར་ནས།
en: “They reach the fifth, the excellent perfect bhūmi

source: །ཡོངས་སུ་དག་པའི་ལམ་རྣམས་ཕྱིར་ཞིང་གོང་དུ་སྦྱོང་།
en: And meditate even higher on the pure good path.

source: །བསམ་དག་མཁས་པ་རྒྱལ་བ་འཐོབ་པར་བྱ་དོན་དུ།
en: The wise, with a pure motivation, for the sake of attaining buddhahood,

source: །སྐྱོ་བ་མེད་པར་སྙིང་རྗེ་བྱམས་པའི་རྗེས་སུ་སེམས།
en: Never disheartened, contemplate compassion and love.

source: །བསོད་ནམས་ཚོགས་བསྩགས་དེ་བཞིན་ཡེ་ཤེས་རབ་ལྡན་པ།
en: “They gather the accumulation of merit and also the highest wisdom.

source: །ས་རྣམས་སྣང་བར་བྱ་ཕྱིར་གཅིག་མིན་ཐབས་རྟོག་ཅིང་།
en: With a variety of methods they cause the radiance of the bhūmi to shine.

source: །སངས་རྒྱས་བྱིན་གྱིས་དྲན་དང་བློ་གྲོས་བློ་ཐོབ་པས།
en: They have the blessing of the buddhas, have mindfulness, have acquired intelligence and understanding,

source: །བདེན་པ་བཞི་པོ་མ་ལུས་ཡང་དག་ཁོང་དུ་ཆུད།
en: And they contemplate the entirety of the four truths. “They perfectly realize the ultimate truth and the truth of relative characteristics,

source: །དོན་དམ་བདེན་པ་དེ་བཞིན་ཀུན་རྫོབ་མཚན་བདེན་དང་། །རྣམ་པར་དབྱེ་བའི་བདེན་པ་དེ་བཞིན་བརྟག་བདེན་དང་། །འབྱུང་ཞིང་འཇུག་དང་དངོས་པོ་ཞི་ལམ་བདེན་པ་ནས།
en: The difference between the truths, the certainty of the truths, And thus also the truth of things, the termination of the outflows,

source: །སྒྲིབ་མེད་བདེན་པའི་བར་དུ་ཡང་དག་རབ་ཏུ་རྟོགས།
en: And the truth of the path, up until the truth of non-obscuration.

source: །དེ་ལྟར་བདེན་པས་ཡོངས་སུ་སྦྱངས་པའི་བློ་ཕྲ་ཡང་།
en: “They thus have subtle understanding through examining the truths,

source: །རྣམ་ཐར་དམ་པ་སྒྲིབ་མེད་དེ་ནི་ཐོབ་པ་མིན།
en: But they have not attained the unobscured highest liberation.

source: །ཡེ་ཤེས་མོས་ཡངས་ཡོན་ཏན་རྣམས་ཀྱི་འབྱུང་གནས་ཏེ།
en: They are greatly dedicated to wisdom and therefore surpass

source: །འགྲོ་ཀུན་དགྲ་བཅོམ་རང་རྒྱལ་རྣམས་ནི་ཟིལ་གྱིས་གནོན།
en: Those pratyekabuddha arhats who develop qualities in this world.

source: །དེ་དག་བདེན་པས་དེ་ལྟར་རང་གི་བློ་བསྒྲུབས་པས།
en: “He has true understanding through realizing the truths,

source: །འདུས་བྱས་བརྫུན་ཞིང་རང་བཞིན་སྙིང་པོ་མེད་པར་ཤེས། །སེམས་ཅན་དོན་དུ་བདེ་གཤེགས་ཡེ་ཤེས་ཚོལ་བའི་ཚེ།
en: And he knows the false nature of composite phenomena to be without essence;

source: །བདེ་གཤེགས་ཐུགས་བརྩེ་བྱམས་པ་སྣང་བ་རབ་ཏུ་ཐོབ།
en: The great radiance of love and compassion of the sugatas is attained, And he seeks the wisdom of the sugatas for the benefit of beings.

source: །འདུས་བྱས་སྔོན་དང་ཕྱི་མཐའ་མཁས་པ་རབ་ཏུ་ལྟ།
en: “Wisely, he sees the past and future of composite phenomena.

source: །གཏི་མུག་མུན་ནག་མུན་པས་འཁྲུགས་ཤིང་སྲེད་ཚགས་པའི།
en: He sees those in the darkness of ignorance, enveloped by darkness, remaining in suffering,

source: །འགྲོ་རྣམས་སྡུག་བསྔལ་ཕུང་པོ་ལྟ་བ་བདག་མེད་ཅིང་།
en: And extracts them from the multiplied mass of suffering of the world,

source: །སྲོག་བྲལ་རྩ་ཤིང་འདྲ་བ་མངོན་པར་སེལ་བ་བྱེད།
en: Which has no self, is devoid of soul, and is the same as grass and trees. “Those engaged in the kleśas will not reach the end,

source: །ཉོན་མོངས་རྗེས་འགྲོ་འདི་དག་འདས་དང་མ་འོངས་པའི། །སྡུག་བསྔལ་རྒྱུན་གཅོད་མཐར་ཕྱིན་གཞལ་བར་ཡོང་མི་བྱེད།
en: Will not stop the continuity of suffering in the past and future.

source: །ཀྱི་ཧུད་འགྲོ་བ་དེ་ལྟར་འཁྱམས་ཤེས་སྙིང་རྗེ་སྐྱེ།
en: Knowing that, alas, they wander in saṃsāra, he develops compassion for them. Deluded by ignorance, they do not stop the continuum of saṃsāra.

source: །གཏི་མུག་འཁྲུལ་བས་འཁོར་བའི་རྒྱུད་དུ་ཕྱིར་མི་ལྡོག །ཕུང་པོའི་གནས་དང་ཁམས་སྦྲུལ་ལྟ་བུའི་ཟུག་རྔུ་ཅན།
en: “They have the skandhas as a basis, the serpents of the sensory elements, and the pain of wrong views.

source: །མེས་གདུངས་ཡིད་ཅན་སྒྲིབ་པའི་མུན་པས་བསྒྲིབས་གྱུར་པ།
en: Their minds are burned by fire, and they are in darkness.

source: །དོན་རྣམས་རྣམ་པར་མ་བརྟགས་སྲེད་པའི་མཚོར་ལྟུང་ཞིང་།
en: Because they have not investigated meanings, they have fallen into the sea of craving;

source: །རྒྱལ་བའི་དེད་དཔོན་བྲལ་བ་སྡུག་བསྔལ་རྒྱ་མཚོར་གནས།
en: They lack the Jina as a leader and remain in the sea of suffering.

source: །དེ་ལྟར་རིག་ནས་བག་ཡོད་ཕྱིར་ཞིང་རབ་ཏུ་རྩོམ།
en: “Knowing this, they engage even more in being attentive,

source: །ཅི་རྩོམ་ཀུན་ཀྱང་འགྲོ་བ་རྣམ་ཐར་དོན་དུ་སྟེ།
en: And what they engage in is for the liberation of all beings.

source: །ཕྱིར་ཞིང་དྲན་ལྡན་བློ་གྲོས་རིག་དང་ལྡན་པ་ཡིན།
en: They have mindfulness, understanding, and knowledge.

source: །ཁྲེལ་ཡོད་དགའ་ལྡན་མཁས་པ་བློ་ལྡན་ཤེས་རབ་ལྡན།
en: They have a conscience and joy, and through their intelligence are wise.

source: །བསོད་ནམས་བསྩགས་དང་ཡེ་ཤེས་དམ་པས་མི་ངོམས་ཤིང་།
en: “They are never satisfied with their accumulation of merit, or with that of the highest wisdom.

source: །རྟག་ཏུ་སྐྱོ་མེད་ལེ་ལོ་མེད་པར་ཐོས་པ་ཚོལ།
en: Never wearied, never lax, they seek the strengths,

source: །ཞིང་བསྒྲུབ་རྒྱལ་བའི་མཚན་དང་སངས་རྒྱས་གསུང་ཚོལ་ཞིང་།
en: The creation of realms, the characteristics of a jina, and the speech of a buddha.
